using System.Runtime.InteropServices;

namespace BossMod.Network.ServerIPC;

// taken from Machina, FFXIVPacketDissector, XIVAlexander, FFXIVOpcodes and custom research
// alternative names:
// StatusEffectListBozja: machina = StatusEffectList2
// StatusEffectListPlayer: machina = StatusEffectList3
// StatusEffectListDouble: machina = BossStatusEffectList
// ActionEffectN: machina = AbilityN
// SpawnObject: FFXIVOpcodes = ObjectSpawn
// SystemLogMessage1: FFXIVOpcodes = SomeDirectorUnk4
// WaymarkPreset: FFXIVOpcodes = PlaceFieldMarkerPreset, machina = PresetWaymark
// Waymark: FFXIVOpcodes = PlaceFieldMarker
// ActorCustomizeData: PlayerUpdateLook
// actor control examples: normal = toggle weapon, self = cooldown, target = target change
public enum PacketID
{
    Ping = 2,
    Init = 3,
    Logout = 8,
    CFCancel = 11,
    CFDutyInfo = 13,
    CFNotify = 14,
    CFPreferredRole = 18,
    CrossWorldLinkshellList = 81,
    FellowshipList = 89,
    Playtime = 111,
    CFRegistered = 112,
    Chat = 115,
    RSVData = 128,
    RSFData = 129,
    SocialMessage = 130,
    SocialMessage2 = 131,
    SocialList = 133,
    SocialRequestResponse = 134,
    ExamineSearchInfo = 135,
    UpdateSearchInfo = 136,
    InitSearchInfo = 137,
    ExamineSearchComment = 138,
    ServerNoticeShort = 141,
    ServerNotice = 142,
    SetOnlineStatus = 143,
    LogMessage = 144,
    Countdown = 148,
    CountdownCancel = 149,
    PartyMessage = 154,
    PlayerAddedToBlacklist = 156,

    AirshipExplorationResult = 554,
    SubmarineStatusList = 555,
    SubmarineProgressionStatus = 556,
    SubmarineExplorationResult = 557,
    SubmarineTimers = 559,
    DeepDungeonMap = 566,
    DeepDungeonItems = 568,
    DeepDungeonParty = 569,
    DeepDungeonChests = 570,
    PrepareZoning = 589,
    ActorGauge = 590,
    CharaVisualEffect = 591,
    LandSetMap = 592,
    Fall = 593,
    PlayMotionSync = 642,
    CEDirector = 651,
    IslandWorkshopDemandResearch = 670,
    IslandWorkshopSupplyDemand = 673,
    IslandWorkshopFavors = 689,
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct IPCHeader
{
    public ushort Magic; // 0x0014
    public ushort MessageType;
    public uint Unknown1;
    public uint Unknown2;
    public uint Epoch;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct RSVData
{
    public int ValueLength;
    public fixed byte Key[48];
    public fixed byte Value[1]; // variable-length
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct Countdown
{
    public uint SenderID;
    public ushort u4;
    public ushort Time;
    public byte FailedInCombat;
    public byte u9;
    public byte u10;
    public fixed byte Text[37];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct CountdownCancel
{
    public uint SenderID;
    public ushort u4;
    public ushort u6;
    public fixed byte Text[32];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardItemListingCount
{
    public uint Error;
    public byte NumItems;
    public fixed byte Padding[3];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardItemListingEntry
{
    public ulong ListingId;
    public ulong SellingRetainerContentId;
    public ulong SellingPlayerContentId;
    public ulong ArtisanId;
    public uint UnitPrice;
    public uint TotalTax;
    public uint Quantity;
    public uint ItemId;
    public ushort ContainerId;
    public ushort Durability;
    public ushort Spiritbond;
    public fixed ushort Materia[5];
    public uint Unk40;
    public ushort Unk44;
    public fixed byte RetainerName[32];
    public fixed byte Unk66[32];
    public byte IsHQ;
    public byte MateriaCount;
    public byte Unk88;
    public byte TownId;
    public byte Stain0Id;
    public byte Stain1Id;
    public uint Unk8C;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardItemListing
{
    public fixed byte EntriesRaw[10 * 0x90];
    public byte NextPageIndex;
    public byte FirstPageIndex;
    public byte RequestId;
    public fixed byte Padding[5];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardPurchase
{
    public uint ItemId;
    public uint ErrorLogId;
    public uint Quantity;
    public byte Stackable;
    public fixed byte Padding[3];
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe struct MarketBoardSale
{
    [FieldOffset(0x00)] public uint ItemId;
    [FieldOffset(0x04)] public uint Quantity;
    [FieldOffset(0x08)] public uint UnitPrice;
    [FieldOffset(0x0C)] public uint TotalTax;
    [FieldOffset(0x10)] public byte SaleType; // 1 = normal sale, 2 = everything sold, 3 = mannequin
    [FieldOffset(0x11)] public byte TownId;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe struct MarketBoardItemListingHistoryEntry
{
    [FieldOffset(0x00)] public uint UnitPrice;
    [FieldOffset(0x04)] public uint SaleUnixTimestamp;
    [FieldOffset(0x08)] public uint Quantity;
    [FieldOffset(0x0C)] public byte IsHQ;
    [FieldOffset(0x0D)] public byte UnkD;
    [FieldOffset(0x0E)] public fixed byte RetainerName[32];
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C8)]
public unsafe struct MarketBoardItemListingHistory
{
    [FieldOffset(0x00)] public uint ItemId;
    [FieldOffset(0x04)] public fixed byte RawEntries[20 * 0x30];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct RetainerState
{
    public ulong RetainerId;
    public ulong Flags; // high byte & 0xF is town, highest bit is whether retainer is now selling
    public uint CustomMessageId;
    public byte StateChange; // % 10 is type (1 for rename?, 3 for start sell, 4 for stop sell)
    public fixed byte Name[32];
    public fixed byte Padding[3];

    public readonly byte Town => (byte)((Flags >> 56) & 0xF);
    public readonly bool IsSelling => (Flags >> 63) != 0;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct Status
{
    public ushort ID;
    public ushort Extra;
    public float RemainingTime;
    public uint SourceID;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct StatusEffectList
{
    public Class ClassID;
    public byte Level;
    public byte u2;
    public byte u3; // != 0 => set alliance member flag 8
