using System.Runtime.InteropServices;

namespace BossMod.Network.ServerIPC;

// taken from Machina, FFXIVPacketDissector, XIVAlexander, FFXIVOpcodes and custom research
// alternative names:
// StatusEffectListBozja: machina = StatusEffectList2
// StatusEffectListPlayer: machina = StatusEffectList3
// StatusEffectListDouble: machina = BossStatusEffectList
// ActionEffectN: machina = AbilityN
// SpawnObject: FFXIVOpcodes = ObjectSpawn
// SystemLogMessage1: FFXIVOpcodes = SomeDirectorUnk4
// WaymarkPreset: FFXIVOpcodes = PlaceFieldMarkerPreset, machina = PresetWaymark
// Waymark: FFXIVOpcodes = PlaceFieldMarker
// ActorCustomizeData: PlayerUpdateLook
// actor control examples: normal = toggle weapon, self = cooldown, target = target change
public enum PacketID
{
    Ping = 2,
    Init = 3,
    Logout = 8,
    CFCancel = 11,
    CFDutyInfo = 13,
    CFNotify = 14,
    CFPreferredRole = 18,
    CrossWorldLinkshellList = 81,
    FellowshipList = 89,
    Playtime = 111,
    CFRegistered = 112,
    Chat = 115,
    RSVData = 127,
    RSFData = 128,
    SocialMessage = 129,
    SocialMessage2 = 130,
    SocialList = 132,
    SocialRequestResponse = 133,
    ExamineSearchInfo = 134,
    UpdateSearchInfo = 135,
    InitSearchInfo = 136,
    ExamineSearchComment = 137,
    ServerNoticeShort = 140,
    ServerNotice = 141,
    SetOnlineStatus = 142,
    LogMessage = 143,
    Countdown = 147,
    CountdownCancel = 148,
    PartyMessage = 153,
    PlayerAddedToBlacklist = 155,

    UnMount = 538,
    CeremonySetActorAppearance = 541,
    AirshipStatusList = 547,
    AirshipStatus = 548,
    AirshipExplorationResult = 549,
    SubmarineStatusList = 550,
    SubmarineProgressionStatus = 551,
    SubmarineExplorationResult = 552,
    SubmarineTimers = 554,
    PrepareZoning = 584,
    ActorGauge = 585,
    CharaVisualEffect = 586,
    LandSetMap = 587,
    Fall = 588,
    PlayMotionSync = 637,
    CEDirector = 646,
    IslandWorkshopDemandResearch = 665,
    IslandWorkshopSupplyDemand = 668,
    IslandWorkshopFavors = 684,
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct IPCHeader
{
    public ushort Magic; // 0x0014
    public ushort MessageType;
    public uint Unknown1;
    public uint Epoch;
    public uint Unknown2;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct RSVData
{
    public int ValueLength;
    public fixed byte Key[48];
    public fixed byte Value[1]; // variable-length
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct Countdown
{
    public uint SenderID;
    public ushort u4;
    public ushort Time;
    public byte FailedInCombat;
    public byte u9;
    public byte u10;
    public fixed byte Text[37];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct CountdownCancel
{
    public uint SenderID;
    public ushort u4;
    public ushort u6;
    public fixed byte Text[32];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardItemListingCount
{
    public uint Error;
    public byte NumItems;
    public fixed byte Padding[3];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardItemListingEntry
{
    public ulong ListingId;
    public ulong SellingRetainerContentId;
    public ulong SellingPlayerContentId;
    public ulong ArtisanId;
    public uint UnitPrice;
    public uint TotalTax;
    public uint Quantity;
    public uint ItemId;
    public ushort ContainerId;
    public ushort Durability;
    public ushort Spiritbond;
    public fixed ushort Materia[5];
    public uint Unk40;
    public ushort Unk44;
    public fixed byte RetainerName[32];
    public fixed byte Unk66[32];
    public byte IsHQ;
    public byte MateriaCount;
    public byte Unk88;
    public byte TownId;
    public byte Stain0Id;
    public byte Stain1Id;
    public uint Unk8C;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardItemListing
{
    public fixed byte EntriesRaw[10 * 0x90];
    public byte NextPageIndex;
    public byte FirstPageIndex;
    public byte RequestId;
    public fixed byte Padding[5];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct MarketBoardPurchase
{
    public uint ItemId;
    public uint ErrorLogId;
    public uint Quantity;
    public byte Stackable;
    public fixed byte Padding[3];
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)]
public unsafe struct MarketBoardSale
{
    [FieldOffset(0x00)] public uint ItemId;
    [FieldOffset(0x04)] public uint Quantity;
    [FieldOffset(0x08)] public uint UnitPrice;
    [FieldOffset(0x0C)] public uint TotalTax;
    [FieldOffset(0x10)] public byte SaleType; // 1 = normal sale, 2 = everything sold, 3 = mannequin
    [FieldOffset(0x11)] public byte TownId;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)]
public unsafe struct MarketBoardItemListingHistoryEntry
{
    [FieldOffset(0x00)] public uint UnitPrice;
    [FieldOffset(0x04)] public uint SaleUnixTimestamp;
    [FieldOffset(0x08)] public uint Quantity;
    [FieldOffset(0x0C)] public byte IsHQ;
    [FieldOffset(0x0D)] public byte UnkD;
    [FieldOffset(0x0E)] public fixed byte RetainerName[32];
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C8)]
public unsafe struct MarketBoardItemListingHistory
{
    [FieldOffset(0x00)] public uint ItemId;
    [FieldOffset(0x04)] public fixed byte RawEntries[20 * 0x30];
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct RetainerState
{
    public ulong RetainerId;
    public ulong Flags; // high byte & 0xF is town, highest bit is whether retainer is now selling
    public uint CustomMessageId;
    public byte StateChange; // % 10 is type (1 for rename?, 3 for start sell, 4 for stop sell)
    public fixed byte Name[32];
    public fixed byte Padding[3];

    public readonly byte Town => (byte)((Flags >> 56) & 0xF);
    public readonly bool IsSelling => (Flags >> 63) != 0;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct Status
{
    public ushort ID;
    public ushort Extra;
    public float RemainingTime;
    public uint SourceID;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public unsafe struct StatusEffectList
{
    public Class ClassID;
    public byte Level;
    public byte u2;
    public byte u3; // != 0 => set alliance member flag 8
