using Dalamud.Memory;
using Dalamud.Utility;
using FFXIVClientStructs.FFXIV.Client.System.Framework;
using ImGuiNET;
using System;
using System.Collections.Generic;
using System.Numerics;
using System.Runtime.InteropServices;
using System.Text;

namespace BossMod
{
    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public unsafe struct Mat4x3
    {
        [FieldOffset(0x00)] public Vector3 Row0;
        [FieldOffset(0x0C)] public Vector3 Row1;
        [FieldOffset(0x18)] public Vector3 Row2;
        [FieldOffset(0x24)] public Vector3 Row3;

        public SharpDX.Matrix M => new(Row0.X, Row0.Y, Row0.Z, 0, Row1.X, Row1.Y, Row1.Z, 0, Row2.X, Row2.Y, Row2.Z, 0, Row3.X, Row3.Y, Row3.Z, 1);
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public unsafe struct CollisionNode
    {
        [FieldOffset(0x00)] public void** Vtbl;
        [FieldOffset(0x08)] public void** Vtbl8;
        [FieldOffset(0x10)] public CollisionNode* Prev;
        [FieldOffset(0x18)] public CollisionNode* Next;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xC0)]
    public unsafe struct CollisionModule
    {
        [FieldOffset(0x10)] public CollisionSceneManager* Manager;
        [FieldOffset(0xA8)] public int LoadInProgressCounter;
        [FieldOffset(0xAC)] public Vector4 ForcedStreamingBounds;

        public static CollisionModule* Instance => (CollisionModule*)Framework.Instance()->BGCollisionModule;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x38)]
    public unsafe struct CollisionSceneManager
    {
        [FieldOffset(0x00)] public void** Vtbl;
        [FieldOffset(0x18)] public CollisionSceneWrapper* FirstScene;
        [FieldOffset(0x20)] public int NumScenes;
        [FieldOffset(0x28)] public Vector4 StreamingBounds;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public unsafe struct CollisionSceneWrapper
    {
        [FieldOffset(0x00)] public CollisionNode Base;
        [FieldOffset(0x20)] public CollisionSceneManager* Owner;
        [FieldOffset(0x28)] public CollisionScene* Scene;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x40)]
    public unsafe struct CollisionScene
    {
        [FieldOffset(0x00)] public void** Vtbl;
        [FieldOffset(0x08)] public CollisionSceneManager* Owner;
        [FieldOffset(0x10)] public CollisionObjectBase* FirstObj;
        [FieldOffset(0x18)] public int NumObjs;
        [FieldOffset(0x20)] public Vector4 StreamingBounds; // center = player pos, w = radius
        [FieldOffset(0x30)] public int NumLoading;
        [FieldOffset(0x38)] public CollisionQuadtree* Quadtree;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x40)]
    public unsafe struct CollisionQuadtree
    {
        [FieldOffset(0x00)] public void** Vtbl;
        [FieldOffset(0x08)] public float MinX;
        [FieldOffset(0x0C)] public float MaxX;
        [FieldOffset(0x10)] public float LeafSizeX;
        [FieldOffset(0x14)] public float MinZ;
        [FieldOffset(0x18)] public float MaxZ;
        [FieldOffset(0x1C)] public float LeafSizeZ;
        [FieldOffset(0x20)] public int NumLevels;
        [FieldOffset(0x28)] public CollisionNode* Nodes;
        [FieldOffset(0x30)] public int NumNodes;
        [FieldOffset(0x38)] public void* Owner;
    }

    public enum CollisionObjectType : int
    {
        Multi = 1,
        Shape = 2,
        Box = 3,
        Cylinder = 4,
        Sphere = 5,
        Plane = 6,
        PlaneEx = 7,
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA0)]
    public unsafe struct CollisionObjectBase
    {
        [FieldOffset(0x00)] public CollisionObjectBaseVTable* Vtbl;
        [FieldOffset(0x00)] public CollisionNode Base;
        [FieldOffset(0x30)] public CollisionObjectBase* PrevNodeObj;
        [FieldOffset(0x38)] public CollisionObjectBase* NextNodeObj;
        [FieldOffset(0x44)] public uint NumRefs;
        [FieldOffset(0x48)] public CollisionScene* Scene;
        [FieldOffset(0x68)] public uint LayerMask;
    }

    [StructLayout(LayoutKind.Explicit, Size = 24*8)]
    public unsafe struct CollisionObjectBaseVTable
    {
        [FieldOffset(17 * 8)] public delegate* unmanaged[Stdcall]<CollisionObjectBase*, CollisionObjectType> GetObjectType;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public unsafe struct CollisionObjectMultiElement
    {
        [FieldOffset(0x00)] public int SubFile;
        [FieldOffset(0x08)] public CollisionObjectShape* Shape;
        [FieldOffset(0x10)] public float MinX;
        [FieldOffset(0x14)] public float MinZ;
        [FieldOffset(0x18)] public float MaxX;
        [FieldOffset(0x1C)] public float MaxZ;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1E0)]
    public unsafe struct CollisionObjectMulti // type 1
    {
        [FieldOffset(0x000)] public CollisionObjectBase Base;
        [FieldOffset(0x0A8)] public fixed byte PathBase[256];
        [FieldOffset(0x1B8)] public float StreamedMinX;
        [FieldOffset(0x1BC)] public float StreamedMinZ;
        [FieldOffset(0x1C0)] public float StreamedMaxX;
        [FieldOffset(0x1C4)] public float StreamedMaxZ;
        [FieldOffset(0x1C8)] public int* PtrNumElements;
        [FieldOffset(0x1D8)] public CollisionObjectMultiElement* Elements;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x198)]
    public unsafe struct CollisionObjectShape // type 2
    {
        [FieldOffset(0x000)] public CollisionObjectBase Base;
        [FieldOffset(0x0C8)] public CollisionShapePCB* Shape; // pointer to interface really
        [FieldOffset(0x0D4)] public Vector3 Translation;
        [FieldOffset(0x0E0)] public Vector3 Rotation;
        [FieldOffset(0x0EC)] public Vector3 Scale;
        [FieldOffset(0x0F8)] public Vector3 TranslationPrev;
        [FieldOffset(0x104)] public Vector3 RotationPrev;
        [FieldOffset(0x110)] public Mat4x3 World;
        [FieldOffset(0x140)] public Mat4x3 InvWorld;
        [FieldOffset(0x170)] public Vector4 BoundingSphere;
        [FieldOffset(0x180)] public Vector3 BoundingBoxMin;
        [FieldOffset(0x18C)] public Vector3 BoundingBoxMax;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x140)]
    public unsafe struct CollisionObjectBox // type 3
    {
        [FieldOffset(0x000)] public CollisionObjectBase Base;
        [FieldOffset(0x0A0)] public Vector3 Translation;
        [FieldOffset(0x0AC)] public Vector3 TranslationPrev;
        [FieldOffset(0x0B8)] public Vector3 Rotation;
        [FieldOffset(0x0C4)] public Vector3 RotationPrev;
        [FieldOffset(0x0D0)] public Vector3 Scale;
        [FieldOffset(0x0DC)] public Mat4x3 World;
        [FieldOffset(0x10C)] public Mat4x3 InvWorld;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x148)]
    public unsafe struct CollisionObjectCylinder // type 4
    {
        [FieldOffset(0x000)] public CollisionObjectBase Base;
        [FieldOffset(0x0A0)] public Vector3 Translation;
        [FieldOffset(0x0AC)] public Vector3 TranslationPrev;
        [FieldOffset(0x0B8)] public Vector3 Rotation;
        [FieldOffset(0x0C4)] public Vector3 RotationPrev;
        [FieldOffset(0x0D0)] public Vector3 Scale;
        [FieldOffset(0x0DC)] public float Radius;
        [FieldOffset(0x0E0)] public Mat4x3 World;
        [FieldOffset(0x110)] public Mat4x3 InvWorld;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x150)]
    public unsafe struct CollisionObjectSphere // type 5
    {
        [FieldOffset(0x000)] public CollisionObjectBase Base;
        [FieldOffset(0x0A4)] public Vector3 Translation;
        [FieldOffset(0x0B0)] public Vector3 TranslationPrev;
        [FieldOffset(0x0BC)] public Vector3 Rotation;
        [FieldOffset(0x0C8)] public Vector3 RotationPrev;
        [FieldOffset(0x0D4)] public Vector3 Scale;
        [FieldOffset(0x0E0)] public Vector3 ScalePrev;
        [FieldOffset(0x0EC)] public Mat4x3 World;
        [FieldOffset(0x11C)] public Mat4x3 InvWorld;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x140)]
    public unsafe struct CollisionObjectPlane // type 6/7
    {
        [FieldOffset(0x000)] public CollisionObjectBase Base;
        [FieldOffset(0x0A0)] public Vector3 Translation;
        [FieldOffset(0x0AC)] public Vector3 TranslationPrev;
        [FieldOffset(0x0B8)] public Vector3 Rotation;
        [FieldOffset(0x0C4)] public Vector3 RotationPrev;
        [FieldOffset(0x0D0)] public Vector3 Scale;
        [FieldOffset(0x0DC)] public Mat4x3 World;
        [FieldOffset(0x10C)] public Mat4x3 InvWorld;
        [FieldOffset(0x13D)] public byte Extended;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x40)]
    public unsafe struct CollisionShapePCB
    {
        [FieldOffset(0x00)] public void** Vtbl;
        [FieldOffset(0x08)] public void** Vtbl8;
        [FieldOffset(0x10)] public CollisionObjectShape* OwnerObj;
        [FieldOffset(0x18)] public CollisionShapePCBData* Data;
    };

    [StructLayout(LayoutKind.Explicit, Size = 0x30)] // variable length structure: followed by raw verts then compressed verts then prims
    public unsafe struct CollisionShapePCBData
    {
        [FieldOffset(0x00)] public ulong Header;
        [FieldOffset(0x08)] public int Child1Offset;
        [FieldOffset(0x0C)] public int Child2Offset;
        [FieldOffset(0x10)] public Vector3 AABBMin;
        [FieldOffset(0x1C)] public Vector3 AABBMax;
        [FieldOffset(0x28)] public ushort NumVertsCompressed; // ushort[3] per vert
        [FieldOffset(0x2A)] public ushort NumPrims;
        [FieldOffset(0x2C)] public ushort NumVertsRaw; // vector3 per vert
    };

    [StructLayout(LayoutKind.Explicit, Size = 0xC)]
    public unsafe struct CollisionShapePrimitive
    {
        [FieldOffset(0x0)] public byte V1;
        [FieldOffset(0x1)] public byte V2;
        [FieldOffset(0x2)] public byte V3;
        [FieldOffset(0x4)] public uint Flags;
        [FieldOffset(0x8)] public uint Unk8;
    }

    public unsafe class DebugCollision : IDisposable
    {
        private UITree _tree = new();
        private (Action, nint) _drawExtra;
        private HashSet<nint> _slaveShapes = new();

        private nint _typeinfoCollisionShapePCB;

        public DebugCollision()
        {
            _typeinfoCollisionShapePCB = Service.SigScanner.GetStaticAddressFromSig("48 8D 0D ?? ?? ?? ?? 48 89 78 10 48 89 08");
            Service.Log($"vtbl CollisionShapePCB: {_typeinfoCollisionShapePCB:X}");

            _drawExtra = (() => { }, 0);
        }

        public void Dispose()
        {

        }

        public void Draw()
        {
            UpdateSlaveShapes();

            if (ImGui.Button("Clear selection"))
                _drawExtra = (() => { }, 0);
            ImGui.SameLine();
            if (ImGui.Button("Export to obj"))
                ExportToObj(true, true);
            ImGui.SameLine();
